In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series : a fixed-length, ordered dict

In [3]:
srs1 = pd.Series([4,7,-5,3])
srs1

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# DataFrame

In [5]:
# DataFrame from NumyPy-array
df1 = pd.DataFrame(np.array([1,2,3,4]))
df1

   0
0  1
1  2
2  3
3  4

In [6]:
# DataFrame from a dict
dict1 = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
           'year': [2000,2001,2002,2001,2002,2003],
           'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
df2_dict = pd.DataFrame(dict1)
df2_dict

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [7]:
df2_dict.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [8]:
df3_dict = pd.DataFrame(dict1, columns=['year','state','pop','debt'],
                          index=['one','two','three','four','five','six'] )
df3_dict

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [37]:
# Retrieve column as a Series by dict-like notation or attribute
column_series = df3_dict['state'] # dict-like notation

In [40]:
column_series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [42]:
# Retrieve column as a DataFrame by dict-like notation or attribute
column_dataframe = df3_dict[['state']] #  double square bracket to select column(s) and want a DataFrame containing the selected column(s)
column_dataframe

        state
one      Ohio
two      Ohio
three    Ohio
four   Nevada
five   Nevada
six    Nevada

In [43]:
column_dataframe.info

<bound method DataFrame.info of         state
one      Ohio
two      Ohio
three    Ohio
four   Nevada
five   Nevada
six    Nevada>

In [10]:
df3_dict.state # using attribute

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [11]:
# Retrieve row by position or name with the special loc attribute
df3_dict.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
# --- Creating DataFrame from nested Dict of Python dicts ---
# Pandas will interpret the outer dict keys as the columns and the inner keys as the row indices

dict_Python = { 'Nevada': { 2002: 2.4, 2002: 2.0 },
                'Ohio': { 2000: 1.5, 2001: 1.7, 2002: 3.6 } }
frame_dict_Python = pd.DataFrame(dict_Python)
frame_dict_Python

      Nevada  Ohio
2002     2.0   3.6
2000     NaN   1.5
2001     NaN   1.7

In [13]:
# --- Creating DataFrame from nested Dict of Pandas Series ---
dict_Series = { 'Nevada': frame_dict_Python['Nevada'][:2],
                'Ohio': frame_dict_Python['Ohio'][:-1] }
frame_dict_Series = pd.DataFrame(dict_Series)
frame_dict_Series

      Nevada  Ohio
2002     2.0   3.6
2000     NaN   1.5

In [14]:
frame_dict_Python.index

Int64Index([2002, 2000, 2001], dtype='int64')

In [15]:
frame_dict_Python.columns

Index(['Nevada', 'Ohio'], dtype='object')

In [16]:
# Indexing. selection, filtering
# Note: Slicing with labels behaves differently than normal Python slicing in that the end-point is inclusive

frame_series = pd.Series(np.arange(4,), index=['a','b','c','d'])
frame_series

a    0
b    1
c    2
d    3
dtype: int32

In [17]:
# Note that with labels the end-point is inclusive
frame_series['b':'c']

b    1
c    2
dtype: int32

In [18]:
# Note that with index, like normal Python slicing, the end-point is exclusive
frame_series[1:3]

b    1
c    2
dtype: int32

In [19]:
# Selection with loc and iloc to select a subset of the rows and columns from a DataFrame with NumPy-like notation
frame1 = pd.DataFrame(np.arange(16).reshape(4,4),
                      index=['Ohio', 'Colorado', 'Utah','New York'],
                      columns=['one', 'two', 'three', 'four'])
frame1

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
frame1.loc[['Colorado'], ['two','three']]

          two  three
Colorado    5      6

In [21]:
frame1.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [22]:
frame1.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [23]:
frame1.loc['Colorado':'Utah']

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [24]:
# Operations between DataFrame and Series
series2 = pd.Series(range(3), index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int64

In [25]:
# Arithmetic between DataFrame and Series
# Default (broadcasting down the DataFrame's rows): Matches the index of the Series on the DataFrame's columns, broadcasting down the rows
frame2 = pd.DataFrame(np.arange(12.).reshape(4,3),
                      index=['Utah', 'Ohio', 'Texas', 'Oregon'],
                      columns=list('bde'))
frame2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [26]:
frame2 +  series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [27]:
#  Option to broadcast over the DataFrame's columns: Matches the index of the Series on the DataFrame's rows, broadcasting over the columns
#  ( Have to use one of the arthmetic methods )
series3 = frame2['d']
frame2.sub(series3, axis=0)  # or axis='index'

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [28]:
# Correlation and Covariance
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame( {ticker: data['Adj Close']
                       for ticker, data in all_data.items() } )
volume = pd.DataFrame( {ticker: data['Volume']
                       for ticker, data in all_data.items() } )

In [29]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-08-31  0.033912 -0.014072 -0.014766 -0.006221
2020-09-01  0.039833  0.000730  0.007715  0.016234
2020-09-02 -0.020718  0.038736  0.019272  0.040687
2020-09-03 -0.080061 -0.029100 -0.061947 -0.050015
2020-09-04  0.000662 -0.017276 -0.014036 -0.030941

In [30]:
returns['MSFT'].corr(returns['IBM'])

0.5803947581676301

In [31]:
returns['MSFT'].cov(returns['IBM'])

0.0001615226484840197

In [32]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.501901  0.698478  0.651976
IBM   0.501901  1.000000  0.580395  0.537152
MSFT  0.698478  0.580395  1.000000  0.781827
GOOG  0.651976  0.537152  0.781827  1.000000

In [33]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000341  0.000148  0.000224  0.000198
IBM   0.000148  0.000257  0.000162  0.000142
MSFT  0.000224  0.000162  0.000301  0.000223
GOOG  0.000198  0.000142  0.000223  0.000271

In [34]:
returns.corrwith(returns.IBM)

AAPL    0.501901
IBM     1.000000
MSFT    0.580395
GOOG    0.537152
dtype: float64

In [35]:
returns.corrwith(volume)

AAPL   -0.100658
IBM    -0.098690
MSFT   -0.053060
GOOG   -0.150852
dtype: float64

In [36]:
returns.corrwith(volume, axis='columns')

Date
2015-09-08         NaN
2015-09-09   -0.524639
2015-09-10    0.816071
2015-09-11    0.885326
2015-09-14    0.925331
                ...
2020-08-31    0.967580
2020-09-01    0.911148
2020-09-02   -0.980765
2020-09-03   -0.856394
2020-09-04    0.876204
Length: 1259, dtype: float64